# Brewfile

# Dotfiles management
brew "stow"     # Symlink farm manager. See: https://www.gnu.org/software/stow/

# CLI tools
cask "ghostty"  # Terminal emulator. See: https://ghostty.org/
brew "helix"    # Editor. See: https://helix-editor.com/
brew "starship" # Prettier prompt. See: https://starship.rs/
brew "eza"      # Prettier `ls`. See: https://eza.rocks/
brew "ripgrep"  # Faster `grep`. See: https://github.com/burntsushi/ripgrep
brew "fd"       # Faster `find`. See: https://github.com/sharkdp/fd
brew "fzf"      # Fuzzy finder. See: https://github.com/junegunn/fzf
brew "zoxide"   # Smarter `cd`. See: https://github.com/ajeetdsouza/zoxide
brew "bat"      # Prettier `cat`. See: https://github.com/sharkdp/bat
brew "tldr"     # More readable `man` pages. https://github.com/tldr-pages/tldr
brew "tree"     # Useful for copy-pasting plaintext directory structures
brew "gh"       # GitHub CLI. See: https://cli.github.com/
brew "git"      # Newer version than that shipped with macOS
brew "rsync"    # File transfers. See: https://linux.die.net/man/1/rsync
brew "ffmpeg"   # Does all things video. See: https://ffmpeg.org/
cask "claude-code" # LLM CLI app. See: https://code.claude.com/docs

# Zsh plugins
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

# Compilers and build tooling
brew "gcc"    # Needed for `gfortran`
brew "make"   # macOS uses GNU Make 3.81 (from 2006)
brew "cmake"

# Scientific libraries
brew "netcdf"
brew "netcdf-fortran"
brew "fftw"
brew "open-mpi"
brew "openblas"

# Python tooling
brew "uv"       # Dependency management. See: https://docs.astral.sh/uv/
brew "ruff"     # Linter. See: https://docs.astral.sh/ruff/
brew "ty"       # LSP and type-checker. See: https://docs.astral.sh/ty/

# Fortran tooling
brew "fortitude" # Linter. See: https://fortitude.readthedocs.io/
brew "fortls"    # LSP. See: https://fortls.fortran-lang.org/

# General utilities
cask "scroll-reverser"     # See: https://pilotmoon.com/scrollreverser/
cask "sensiblesidebuttons" # See: https://sensible-side-buttons.archagon.net/
cask "rectangle"           # Window management. See: https://rectangleapp.com/
cask "stats"               # System monitor. See: https://mac-stats.com/

# Writing and LaTeX tooling
cask "zotero"   # Reference management. See: https://www.zotero.org/
brew "tectonic" # Modern TeX engine. See: https://tectonic-typesetting.github.io/
brew "pandoc"   # Document conversion. See: https://pandoc.org/

# GUI apps
cask "zen"         # Web browser. See: https://zen-browser.app/
cask "obsidian"    # Markdown notes. See: https://obsidian.md/
cask "zoom"        # Video conferencing. See: https://www.zoom.com/
cask "claude"      # LLM GUI app. See: https://claude.com
cask "whatsapp"    # Messaging service. See: https://whatsapp.com/
cask "proton-pass" # Password manager. See: https://proton.me/pass
cask "protonvpn"   # VPN. See: https://protonvpn.com/
cask "proton-mail-bridge" # Use Mail app with Proton https://proton.me/mail/bridge
